       IDENTIFICATION DIVISION.
       PROGRAM-ID. BEC-1141.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TB-STRINGS-FOTO OCCURS 1 TO 6 DEPENDING ON QTD-STRINGS-FOTO.
           03 FOTO               PIC X(20).
           03 TAMANHO-FOTO       PIC 9(04).
       01 TB-STRINGS-IGNORAR PIC 9(04) OCCURS 1 TO 6
                                          DEPENDING ON QTD-STRINGS-FOTO.
       01 ENTRADA.
           03 STR-ENTRADA       PIC X(20).
       77 QTD-STRINGS-FOTO      PIC 9(02).
       01 INDICES-ENT-SAI.
           03 IC-ENT-STR        PIC 9(02).
           03 IC-SAI-STR        PIC 9(02).
       01 VRV-CALCULO-TAM-STR.
           03 CCT-FT-STR PIC X(01).
           03 IC-DESCOB-TAMANHO PIC 9(02).
           03 TAMANHO-STRING PIC 9(04).
       01 VRV-BUBBLE-SORT.
           03 IC-BS-1 PIC 9(02).
           03 IC-BS-2 PIC 9(02).
           03 VRV-TROCA-FT-STRING.
               05 VRV-TROCA-FOTO PIC X(20).
               05 VRV-TROCA-TAMANHO-FOTO PIC 9(04).
           03 ELEMENTO-1-TB PIC X(20).
           03 ELEMENTO-2-TB PIC X(20).
           03 QTD-TROCAS-BUBBLE-SORT PIC 9(04).
       01 TAMANHO-SEQUENCIAS.
           03 TM-SEQUENCIA-ATUAL PIC 9(04).
           03 TM-MAIOR-SEQUENCIA PIC 9(04) VALUES ZEROS.
       01 VRV-DESCOBRIR-MAIOR-SEQ.
           03 IC-ITER-TODAS-FOTOS PIC 9(02).
           03 FLAG-EH-SUBSTRING PIC 9(02).
       PROCEDURE DIVISION.
       PRINCIPAL.
           PERFORM RECEBER-STRINGS-FT
           PERFORM ORDENAR-TB-STRINGS-FT
           PERFORM DESCOBRIR-MAIOR-SEQ
           STOP RUN
           .
       RECEBER-STRINGS-FT.
           ACCEPT QTD-STRINGS-FOTO FROM CONSOLE
           PERFORM VARYING IC-ENT-STR FROM 1 BY 1
           UNTIL IC-ENT-STR > QTD-STRINGS-FOTO
               ACCEPT STR-ENTRADA FROM CONSOLE
               PERFORM CALCULAR-TAMANHO-STRING
               MOVE STR-ENTRADA    TO TB-STRINGS-FOTO(IC-ENT-STR)
               MOVE TAMANHO-STRING TO TAMANHO-FOTO(IC-ENT-STR)
           END-PERFORM
           EXIT
           .
       CALCULAR-TAMANHO-STRING.
           MOVE SPACE TO CCT-FT-STR
           PERFORM VARYING IC-DESCOB-TAMANHO FROM 20 BY -1
           UNTIL CCT-FT-STR NOT EQUAL SPACE
               MOVE STR-ENTRADA(IC-DESCOB-TAMANHO:1) TO CCT-FT-STR
               IF CCT-FT-STR NOT EQUAL SPACE
                   MOVE IC-DESCOB-TAMANHO TO TAMANHO-STRING
               END-IF
           END-PERFORM
           EXIT
           .
       MOSTRAR-TB-STRINGS-FT.
           PERFORM VARYING IC-SAI-STR FROM 1 BY 1
           UNTIL IC-SAI-STR > QTD-STRINGS-FOTO
               DISPLAY 'STRINGS FOTO: ' TB-STRINGS-FOTO(IC-SAI-STR)
           END-PERFORM
           EXIT
           .
       ORDENAR-TB-STRINGS-FT.
           PERFORM VARYING IC-BS-1 FROM 1 BY 1
           UNTIL IC-BS-1 > QTD-STRINGS-FOTO
               MOVE ZEROS TO QTD-TROCAS-BUBBLE-SORT
               PERFORM VARYING IC-BS-2 FROM 1 BY 1
               UNTIL IC-BS-2 > QTD-STRINGS-FOTO
                   IF TAMANHO-FOTO(IC-BS-1)
                   GREATER THAN TAMANHO-FOTO(IC-BS-2)
                       PERFORM REALIZAR-TROCAS-BUBBLE-SORT
                       ADD 1 TO QTD-TROCAS-BUBBLE-SORT
                   END-IF
               END-PERFORM
               IF QTD-TROCAS-BUBBLE-SORT NOT GREATER THAN ZEROS
                   EXIT PERFORM
               END-IF
           END-PERFORM
           EXIT
           .
       REALIZAR-TROCAS-BUBBLE-SORT.
           MOVE FOTO(IC-BS-1) TO VRV-TROCA-FOTO
           MOVE TAMANHO-FOTO(IC-BS-1)
           TO VRV-TROCA-TAMANHO-FOTO
           MOVE FOTO(IC-BS-2) TO FOTO(IC-BS-1)
           MOVE TAMANHO-FOTO(IC-BS-2)
           TO VRV-TROCA-TAMANHO-FOTO
           MOVE VRV-TROCA-FOTO TO FOTO(IC-BS-2)
           MOVE VRV-TROCA-TAMANHO-FOTO
           TO TAMANHO-FOTO(IC-BS-2)
           EXIT
           .
       DESCOBRIR-MAIOR-SEQ.
           MOVE 0 TO TM-SEQUENCIA-ATUAL
           PERFORM VARYING IC-ITER-TODAS-FOTOS FROM 1 BY 1
           UNTIL IC-ITER-TODAS-FOTOS > QTD-STRINGS-FOTO
               MOVE 0 TO FLAG-EH-SUBSTRING
               IF IC-ITER-TODAS-FOTOS EQUAL QTD-STRINGS-FOTO

               ELSE

               END-IF
               INSPECT FOTO(IC-ITER-TODAS-FOTOS + 1)
               TALLYING FLAG-EH-SUBSTRING
               FOR ALL FUNCTION TRIM(FOTO(IC-ITER-TODAS-FOTOS))
               IF FLAG-EH-SUBSTRING GREATER THAN 0
                   DISPLAY "FLAG-EH-SUBSTRING: " FLAG-EH-SUBSTRING
               END-IF
           END-PERFORM
           EXIT
           .
