      * Agradeço ao otário que mexeu no meu computador
      * Agradeço ao COBOL por ser uma linguagem chata (Java é melhor)
      * Posso refatorar, mas estou com preguiça
      * Como dizem: se funciona, não mexe
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MaiorSubstringComum.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STRING-1 PIC X(50).
       01 STRING-2 PIC X(50).
       01 COPIAS-STRINGS.
           03 COPIA-MENOR-STRING PIC X(50).
           03 COPIA-MAIOR-STRING PIC X(50).
       01 STRING-ANALISE PIC X(50).
       01 CARACTER PIC X(01).
       01 IC-OBTER-POSICAO     PIC 9(04).
       01 ULTIMA-POSICAO PIC 9(04).
       01 ULTIMAS-POSICOES.
           03 POS-ULTIMO-1 PIC 9(04).
           03 POS-ULTIMO-2 PIC 9(04).
           03 POS-ULTIMO-MENOR PIC 9(04).
           03 POS-ULTIMO-MAIOR PIC 9(04).
       01 INDICES.
           03 IC-MENOR-STR PIC 9(04).
           03 IC-MAIOR-STR PIC 9(04).
       77 INCRE-POS-FINAL-MENOR PIC 9(04).
       77 INCRE-POS-FINAL-MAIOR PIC 9(04).
       01 NUMERO-POSSIBILIDADES.
           03 POSSIBILIDADES-MENOR PIC 9(04).
           03 POSSIBILIDADES-MAIOR PIC 9(04).
       77 SUBSTRINGS-MAIOR PIC X(50) OCCURS 1 TO 1075 DEPENDING ON
           POSSIBILIDADES-MAIOR INDEXED BY IC-TB-MAIOR.
       77 SUBSTRINGS-MENOR PIC X(50) OCCURS 1 TO 1075 DEPENDING ON
           POSSIBILIDADES-MENOR INDEXED BY IC-TB-MENOR.
       77 IC-INICIO-SUBSTR PIC 9(04).
       77 QTD-CCT-SUBSTR PIC 9(04).
       77 SUBSTRING-1 PIC X(50).
       77 SUBSTRING-2 PIC X(50).
       77 TAMANHO-MAIOR-SUBSTR PIC 9(04).
       PROCEDURE DIVISION.
           ACCEPT STRING-1
           ACCEPT STRING-2
           PERFORM OBTER-FINAL-MAIOR-MENOR
           PERFORM DETERMINAR-MENOR-MAIOR
           PERFORM CALCULAR-SUBSTRINGS-POSSIVEIS
           PERFORM OBTER-SUBSTRINGS-MENOR
           PERFORM OBTER-SUBSTRINGS-MAIOR
           PERFORM ENCONTRAR-MAIOR-SUBSTRING-COMUM
           STOP RUN
           .
       OBTER-ULTIMA-POSICAO.
           MOVE SPACE TO CARACTER
           PERFORM VARYING IC-OBTER-POSICAO FROM 50 BY -1
           UNTIL CARACTER NOT EQUAL SPACE
               MOVE STRING-ANALISE(IC-OBTER-POSICAO:1) TO CARACTER
               IF CARACTER NOT EQUAL SPACE
                   MOVE IC-OBTER-POSICAO TO ULTIMA-POSICAO
               END-IF
           END-PERFORM
           EXIT
           .
       OBTER-FINAL-MAIOR-MENOR.
           MOVE STRING-1 TO STRING-ANALISE
           PERFORM OBTER-ULTIMA-POSICAO
           MOVE ULTIMA-POSICAO TO POS-ULTIMO-1
           MOVE STRING-2 TO STRING-ANALISE
           PERFORM OBTER-ULTIMA-POSICAO
           MOVE ULTIMA-POSICAO TO POS-ULTIMO-2
           EXIT
           .
       CALCULAR-SUBSTRINGS-POSSIVEIS.
           COMPUTE POSSIBILIDADES-MENOR =
           (1 + POS-ULTIMO-MENOR)*POS-ULTIMO-MENOR/2
           COMPUTE POSSIBILIDADES-MAIOR =
           (1 + POS-ULTIMO-MAIOR)*POS-ULTIMO-MAIOR/2
           EXIT
           .
       DETERMINAR-MENOR-MAIOR.
           IF POS-ULTIMO-1 > POS-ULTIMO-2
               MOVE STRING-1 TO COPIA-MAIOR-STRING
               MOVE STRING-2 TO COPIA-MENOR-STRING
               MOVE POS-ULTIMO-1 TO POS-ULTIMO-MAIOR
               MOVE POS-ULTIMO-2 TO POS-ULTIMO-MENOR
           ELSE
               MOVE STRING-2 TO COPIA-MAIOR-STRING
               MOVE STRING-1 TO COPIA-MENOR-STRING
               MOVE POS-ULTIMO-1 TO POS-ULTIMO-MENOR
               MOVE POS-ULTIMO-2 TO POS-ULTIMO-MAIOR
           END-IF
           EXIT
           .
       OBTER-SUBSTRINGS-MAIOR.
           SET IC-TB-MAIOR TO 1
           PERFORM VARYING IC-MAIOR-STR FROM 1 BY 1
           UNTIL IC-MAIOR-STR > POS-ULTIMO-MAIOR
               MOVE 1 TO QTD-CCT-SUBSTR
               PERFORM VARYING IC-INICIO-SUBSTR FROM IC-MAIOR-STR BY 1
               UNTIL IC-INICIO-SUBSTR > POS-ULTIMO-MAIOR
                   MOVE COPIA-MAIOR-STRING(IC-MAIOR-STR:QTD-CCT-SUBSTR)
                   TO SUBSTRINGS-MAIOR(IC-TB-MAIOR)
                   IF IC-TB-MAIOR
                   NOT GREATER OR EQUAL POSSIBILIDADES-MAIOR
                       SET IC-TB-MAIOR UP BY 1
                   END-IF
                   ADD 1 TO QTD-CCT-SUBSTR
               END-PERFORM
           END-PERFORM
           EXIT
           .
       OBTER-SUBSTRINGS-MENOR.
           SET IC-TB-MENOR TO 1
           PERFORM VARYING IC-MENOR-STR FROM 1 BY 1
           UNTIL IC-MENOR-STR > POS-ULTIMO-MENOR
               MOVE 1 TO QTD-CCT-SUBSTR
               PERFORM VARYING IC-INICIO-SUBSTR FROM IC-MENOR-STR BY 1
               UNTIL IC-INICIO-SUBSTR > POS-ULTIMO-MENOR
                   MOVE COPIA-MENOR-STRING(IC-MENOR-STR:QTD-CCT-SUBSTR)
                   TO SUBSTRINGS-MENOR(IC-TB-MENOR)
                   SET IC-TB-MENOR UP BY 1
                   ADD 1 TO QTD-CCT-SUBSTR
               END-PERFORM
           END-PERFORM
           EXIT
           .
       ENCONTRAR-MAIOR-SUBSTRING-COMUM.
           MOVE 0 TO TAMANHO-MAIOR-SUBSTR
           PERFORM VARYING IC-MENOR-STR FROM 1 BY 1
           UNTIL IC-MENOR-STR > POSSIBILIDADES-MENOR
               SET IC-TB-MENOR TO IC-MENOR-STR
               PERFORM VARYING IC-MAIOR-STR FROM 1 BY 1
               UNTIL IC-MAIOR-STR > POSSIBILIDADES-MAIOR
                   SET IC-TB-MAIOR TO IC-MAIOR-STR
                   IF SUBSTRINGS-MENOR(IC-TB-MENOR) EQUAL
                   SUBSTRINGS-MAIOR(IC-TB-MAIOR)
                       MOVE SUBSTRINGS-MAIOR(IC-TB-MAIOR)
                       TO STRING-ANALISE
                       PERFORM OBTER-ULTIMA-POSICAO
                       IF TAMANHO-MAIOR-SUBSTR LESS THAN ULTIMA-POSICAO
                           MOVE ULTIMA-POSICAO TO TAMANHO-MAIOR-SUBSTR
                       END-IF
                   END-IF
               END-PERFORM
           END-PERFORM
           DISPLAY TAMANHO-MAIOR-SUBSTR
           EXIT
           .
